---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessLevel
source: html/d03286f0-aa98-d5c3-83e8-fffb245321e5.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessLevel Property

Write access level of the schema.

## Syntax (C#)
```csharp
public AccessLevel WriteAccessLevel { get; }
```